{"data":{"list":[{"id":1,"title":"Управление проектами123","content":"<p>С чего все начиналось? Что такое проект? Что такое управление проектами? Кто такой управляющий проектом? Какими знаниями, умениями и навыками он должен обладать? Кто работает над проектом?sd Где можно получить необходимые знания об управлении проектами? В основе дисциплины управления проектами лежат методики сетевого планирования, разработанные в конце 50-х годов в США. В 1956 г. М.Уолкер из фирмы «Дюпон», исследуя возsможности более эффективного использования принадлежащей фирме вычислительной машины Univac, объе<strong>динил свои усилия с Д.Келли из группы планирования капитального строительства фирмы «Ремингтон Рэнд». Первоначально метод был назван методом Уолкера-Келли, а позже получил название Метода Критического Пути — МКП (или CPM — Critical Path Method). Параллельно и независимо в ходе реализации заказа военно-морских сил США был создан метод анализа и оценки программ PERT (Program Evaluation and Review Technique). Данный метод был разработан корпорацией «Локхид» и консалтинговой фирмой «Буз, Аллен энд Гамильто</strong>dfsdfsfsdfн» для реализации <strong>проекта разработки </strong>ракетной системы «Поларис». Использование метода PERT позволило руководству программы точно знать, что требуется делать в каждый момент времени и кто именно должен это делать, а также вероятность своевременного завершения работ. Руководство программой<code> оказалось настолько успешным, что проект удалось завершить на два года раньше запланированного срока. Широкое применение методика планирования работ на основе проекта получила в строительстве. Например, для управления проектом сооружения гидроэлектростанции на реке Черчилль в Ньюфаундленде (полуостров Лабрадор). В совреме</code>нном же быстроменяющемся мире организации, которые на практике применяют методы управления проектами, имеют конкурентное преимущество перед теми, кто работает «по наитию». Поскольку конкуренция становится либо основанной на времени, либо основанной на стоимости, либо основанной на качестве. А это и есть основные параметры, которые исследуют методы и средства для управления проектами. Таким образом, исходя из исторических предпосылок и современного состояния методологии управления проектами, можем дать несколько основных определений проекта.</p>\n"},{"id":4,"title":"FrontBook","content":"<p>На данном стайте будет представлена информация об основных направлениях front-end разработки.</p>\n<p>Например,</p>\n<ul>\n<li>типизации</li>\n<li>интеграция с back-end'ом</li>\n<li>тестирование</li>\n<li>необходимые инструменты</li>\n<li>популярные библиотеки</li>\n<li>верстка</li>\n<li>дизайн</li>\n</ul>\n<p>С каждым разом статьи будут пополнять на данном сайте. После появления аутентификации у каждого пользователя будет возможность написать свою статью. После успешной модерации статья будет общедоступна.</p>\n<p>Скоро официальное открытие сайта, мы рады вас приветствовать!</p>\n"},{"id":5,"title":"Что еще надо сделать","content":"<p>Базу данных добавить с юзерами и ролями + круд для статей</p>\n<p>Добавление картинок в статьи</p>\n<p>регистрацию через oauth</p>\n<p><strong>подобрать дизайн</strong></p>\n<p>перейти на editor js</p>\n"}]},"errors":[]}